ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_ethif.h
/***************************************************************************//**
* \file cy_ethif.h
* \version 1.0
*
* Provides an API declaration of the Ethernet Interface driver
*
********************************************************************************
* \copyright
* Copyright 2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_ethif
* \{
* The ETHIF driver is wrapper around Cadence's EMAC core driver. This is a
* network interface driver to Cadence core EMAC driver. It provides APIs to
* communicate with Ethernet IP. The PHY driver also uses this driver to
* communicate with PHY chip (via application). This driver has internal buffer
* management, handling callbacks from Cadence EMAC during transport, etc.
*
* The functions and other declarations used in this driver are in cy_ethif.h.
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions
* and declarations in the PDL.
*
* \section group_ethif_more_information More Information
*
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_ethif_MISRA MISRA-C Compliance
* The Ethernet driver has no specific deviations
*
* \section group_ethif_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_ethif_macros Macros
* \defgroup group_ethif_functions Functions
* \defgroup group_ethif_data_structures Data Structures
* \defgroup group_ethif_enums Enumerated Types
*/

#if !defined (CY_ETHIF_H)
#define CY_ETHIF_H

#include "cy_device.h"

#if defined (CY_IP_MXETH)

#include <stddef.h>
#include "cy_syslib.h"
#include "cdn_errno.h"
#include "cedi.h"
#include "emac_regs_macro.h"
#include "edd_int.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_ethif_macros
* \{
*/

/** Driver major version */
#define CY_ETHIF_DRV_VERSION_MAJOR        1

/** Driver minor version */
#define CY_ETHIF_DRV_VERSION_MINOR        0

/** Eth driver ID */
#define CY_ETHIF_ID                     CY_PDL_DRV_ID(0x51U)

/** \} group_ethif_macros */

/***************************************
*        Constants
***************************************/

/** \cond INTERNAL */

/*############################################################################*/
/** Ethernet configurations constants  */
#define CY_ETH_STANDARD_BD                  (0)                         // Standard Buffer Descriptor Mode
#define CY_ETH_EXTENDED_BD                  (1)                         // Extended Buffer Descriptor Mode
#define CY_ETH_TX_FSFM                      (0)                         // Full Store and Forward Mode [FSFM] for Tx
#define CY_ETH_TX_PSFM                      (1)                         // Partial Store and Forward Mode [PSFM] for Tx
#define CY_ETH_RX_FSFM                      (0)                         // Full Store and Forward Mode for Rx
#define CY_ETH_RX_PSFM                      (1)                         // Partial Store and Forward Mode for Rx

/** Ethernet channel  */
#define CY_ETH_DEFINE_NUM_IP                (1)                         // Number of Ethernet channels intended to use, maximum 2
#define CY_ETH_DEFINE_NUM_RXQS              (2)                         // Number of queues intended to use, maximum 2
#define CY_ETH_DEFINE_NUM_TXQS              (2)                         // Number of queues intended to use, maximum 2

/** Ethernet Operation Mode */
#define CY_ETH_DEFINE_TX_OP_MODE            CY_ETH_TX_FSFM              // FSFM OR PSFM
#define CY_ETH_DEFINE_RX_OP_MODE            CY_ETH_RX_FSFM              // FSFM OR PSFM
#define CY_ETH_DEFINE_TX_WATERMARK          (50)                        // Watermark level for Tx
#define CY_ETH_DEFINE_RX_WATERMARK          (50)                        // Watermark level for Rx

/** Buffer Descriptor mode  */
#define CY_ETH_DEFINE_BD                    CY_ETH_EXTENDED_BD          // standard or extended

/** Memory Allocation defines */                                        // Frame Buffers are allocated based on number of buffer descriptors 
#define CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE  (2)                         // Total number of Buffer Descriptors allocated for each transmit queue
#define CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE  (4)                         // Total number of Buffer Descriptors allocated for each receive queue
/*############################################################################*/

#define CY_ETH_TX_PBUF_SIZE                 (1)                         // 1: Use full configured addressable space 
#define CY_ETH_RX_PBUF_SIZE                 (3)                         // 3: Use full configured addressable space

#define CY_ETH0_ADDR_REG_BASE               (ETH0_BASE)                 // Register area for ETH0

#define CY_ETH0_GEMGXL_ADDR_REGBASE         (ETH0_BASE + 0x00001000)    // Register area for GEMGXL

/** Driver constants    */
#define CY_ETH_SIZE_MIN_FRAME               (64)
#define CY_ETH_SIZE_MAX_FRAME               (1536)
#define CY_ETH_SIZE_BUF_TXQ_RXQ             (1536)

#if CY_ETH_DEFINE_BD == CY_ETH_EXTENDED_BD
#define CY_ETH_BD_SIZE                      (16)        // Bytes
#else
#define CY_ETH_BD_SIZE                      (8)         // Bytes
#endif

#define CY_ETH_DISABLE_0                    (0)
#define CY_ETH_ENABLE_1                     (1)
#define CY_ETH_MDIO_BUSY_0                  (0)
#define CY_ETH_MDIO_IDLE_1                  (1)
#define CY_ETH_QS0_0                        (0)
#define CY_ETH_QS1_1                        (1)
#define CY_ETH_QS2_2                        (2)
#define CY_ETH_QS3_3                        (3)
#define CY_ETH_NOT_INITIALIZE_0             (0)
#define CY_ETH_INITIALIZE_1                 (1)
#define CY_ETHIF_BUFFER_CLEARED_0           (0)

#define CY_ETH_TOTAL_TX_BUF                 (CY_ETH_DEFINE_NUM_IP * CY_ETH_DEFINE_NUM_TXQS * CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE)
#define CY_ETH_TOTAL_RX_BUF                 (CY_ETH_DEFINE_NUM_IP * CY_ETH_DEFINE_NUM_RXQS * CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE * 2)   // *2 is to replace the already provided buffer to BDs
    
#define CY_ETHIF_NO_BUFFER_AVAILABLE          (255)
#define CY_ETHIF_BUFFER_AVAILABLE             (254)
    
#define CY_ETHIF_MDIO_READ_FAILED             (2)
#define CY_ETHIF_PHY_FLAG                     (0)                         // defines clause 22
    
#define CY_ETHIF_TX_STATUS_CLEAR              (0x000001FF)
    
