ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_ethif.h
#define CY_EHTIF_EMPTYVALUE                   (0xDEADBEEF)
    
#define CY_ETHIF_PAUSE_P0                     (0)
#define CY_ETHIF_PAUSE_P1                     (1)
#define CY_ETHIF_PAUSE_P2                     (2)
#define CY_ETHIF_PAUSE_P3                     (3)
#define CY_ETHIF_PAUSE_P4                     (4)
#define CY_ETHIF_PAUSE_P5                     (5)
#define CY_ETHIF_PAUSE_P6                     (6)
#define CY_ETHIF_PAUSE_P7                     (7)

/** \endcond */

/***************************************
*        Enumerations
***************************************/

/**
* \addtogroup group_ethif_enums
* \{
*/

/**
 *****************************************************************************
 ** \brief Eth driver error codes.
 ** 
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_SUCCESS = 0,               /**< Returned successful */
    CY_ETHIF_BAD_PARAM,                 /**< Bad parameter was passed */
    CY_ETHIF_MEMORY_NOT_ENOUGH,         /**< Assigned memory for BDs not enough */
    CY_ETHIF_LINK_DOWN,                 /**< Link between nodes is not up */
    CY_ETHIF_LINK_UP,                   /**< Link between nodes is up */
    CY_ETHIF_BUFFER_NOT_AVAILABLE,      /**< No local buffer available to send the frame */
} cy_en_ethif_status_t;

/**
 *****************************************************************************
 ** \brief Eth driver buffer status.
 ** 
 *****************************************************************************/
typedef enum 
{
    CY_ETHIF_BUFFER_UNINIT = 0,         /**< Buffer Uninitialized */
    CY_ETHIF_BUFFER_FREE,               /**< Buffer free and cleared with CY_EHTIF_EMPTYVALUE */
    CY_ETHIF_BUFFER_OCCUPIED,           /**< Buffer has been allocated to BD or in case of Tx loaded with the source data */
    CY_ETHIF_BUFFER_RELEASED,           /**< Buffer has been used and can be written with CY_EHTIF_EMPTYVALUE */
} cy_en_ethif_buffer_status_t;

/**
 *****************************************************************************
 ** \brief EMAC Drive Modes.
 ** 
 *****************************************************************************/
typedef enum 
{
    CY_ETHIF_CTL_MII_10         = 0, /**< CTL.ETH_MODE 2'd0      | Network_config[0](speed)         0 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  MII - 10Mbps */
    CY_ETHIF_CTL_MII_100        = 1, /**< CTL.ETH_MODE 2'd0      | Network_config[0](speed)         1 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  MII - 100Mbps */
    CY_ETHIF_CTL_GMII_1000      = 2, /**< CTL.ETH_MODE 2'd1      | Network_config[0](speed)         0 | Network_config[10](gigabit_mode_enable)         1 | PHY mode  GMII - 1000Mbps */
    CY_ETHIF_CTL_RGMII_10       = 3, /**< CTL.ETH_MODE 2'd2      | Network_config[0](speed)         0 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  RGMII - 10Mbps (4bits/Cycle) */
    CY_ETHIF_CTL_RGMII_100      = 4, /**< CTL.ETH_MODE 2'd2      | Network_config[0](speed)         1 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  RGMII - 100Mbps (4bits/Cycle) */
    CY_ETHIF_CTL_RGMII_1000     = 5, /**< CTL.ETH_MODE 2'd2      | Network_config[0](speed)         0 | Network_config[10](gigabit_mode_enable)         1 | PHY mode  RGMII - 1000Mbps (8bits/Cycle) */
    CY_ETHIF_CTL_RMII_10        = 6, /**< CTL.ETH_MODE 2'd3      | Network_config[0](speed)         0 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  RMII - 10Mbps */
    CY_ETHIF_CTL_RMII_100       = 7, /**< CTL.ETH_MODE 2'd3      | Network_config[0](speed)         1 | Network_config[10](gigabit_mode_enable)         0 | PHY mode  RMII - 100Mbps */
} cy_en_ethif_speed_sel_t;

/**
 *****************************************************************************
 ** \brief Reference Clock for RMII/RGMII.
 ** 
 *****************************************************************************/
typedef enum 
{
    CY_ETHIF_EXTERNAL_HSIO = 0,         /**< Clock coming from HSIO */
    CY_ETHIF_INTERNAL_PLL,              /**< Clock referenced from Internal PLL source */
} cy_en_ethif_clock_ref;

/** Filter Type */
typedef enum
{
    CY_ETH_FILTER_TYPE_DESTINATION = 0, /**< filter on destination address */
    CY_ETH_FILTER_TYPE_SOURCE      = 1, /**< filter on source address */
} cy_en_ethif_filter_type_t;

/** number of filters supported */
typedef enum
{
    CY_ETH_FILTER_NUM_1 = 1, /**< filter 1 */
    CY_ETH_FILTER_NUM_2 = 2, /**< filter 2 */
    CY_ETH_FILTER_NUM_3 = 3, /**< filter 3 */
    CY_ETH_FILTER_NUM_4 = 4, /**< filter 4 */
    CY_ETH_FILTER_NUM_INV, /**< Invalid Filter */
} cy_en_ethif_filter_num_t;

/** \} group_ethif_enums */


/***************************************
*        Configuration Structures
***************************************/
/**
* \addtogroup group_ethif_data_structures
* \{
*/

/**
 *****************************************************************************
 ** \brief Wrapper Configuration 
 *****************************************************************************/
typedef struct
{
    cy_en_ethif_speed_sel_t stcInterfaceSel;    /**< Interface selection for ENET */
    cy_en_ethif_clock_ref bRefClockSource;              /**< Reference clock selection */
    uint8_t u8RefClkDiv;                              /**< Actual division would be u8RefClkDiv + 1 */
} cy_stc_ethif_wrapper_config_t;

/**
 *****************************************************************************
 ** \brief Queue status
 *****************************************************************************/
typedef struct
{
    bool bTxQueueDisable[CY_ETH_QS2_2+1];                              /**< Tx Queue0-2 || 0: Queue Enabled, 1: Queue Disabled */
    bool bRxQueueDisable[CY_ETH_QS2_2+1];                              /**< Rx Queue0-2 || 0: Queue Enabled, 1: Queue Disabled */
} cy_stc_ethif_queue_disablestatus_t;

/**
 *****************************************************************************
 ** \brief Buffer status
 *****************************************************************************/
typedef struct
{
    CEDI_BuffAddr               cy_ethif_bufaddr;       /**< Buffer address as per requirement by Cadence driver */
    cy_en_ethif_buffer_status_t     enBufStatus;            /**< Buffer status */
} cy_stc_ethif_bufstatus_t;

/**
 *****************************************************************************
 ** \brief Time Stamp Unit Init
 *****************************************************************************/
typedef struct
{
    CEDI_1588TimerVal * pstcTimerValue;                 /**< TSU Timer value     */
    CEDI_TimerIncrement * pstcTimerIncValue;            /**< TSU Timer increment value   */
    bool bOneStepTxSyncEnable;                          /**< One step sync enable    */
    CEDI_TxTsMode enTxDescStoreTimeStamp;               /**< Store Time stamp value in Tx descriptor */
    CEDI_RxTsMode enRxDescStoreTimeStamp;               /**< Store Time stamp value in Rx descriptor */
    bool bStoreNSinRxDesc;                              /**< Store NanoSecond field of TSU in Rx Descriptor  */
} cy_stc_ethif_tsu_config_t;

/**
 *****************************************************************************
 ** \brief Frame transmission complete callback function (cy_ethif_tx_msg_func_ptr_t).
 **
 ** Signals a successful completed transmission.
 *****************************************************************************/
 typedef void (*cy_ethif_tx_msg_cb_t)(uint8_t u8QueueIndex);

 /**
 *****************************************************************************
 ** \brief Frame transmission Error callback function (cy_ethif_tx_error_func_ptr_t).
 **
 ** Signals a transmission error.
 *****************************************************************************/
 typedef void (*cy_ethif_tx_error_cb_t)(uint8_t u8QueueIndex);
 
 /**
 *****************************************************************************
 ** \brief Frame received callback function (cy_ethif_rx_frame_func_ptr_t).
 **
 ** Signals a successful reception of frame.
 *****************************************************************************/
 typedef void (*cy_ethif_rx_frame_cb_t)(uint8_t * u8RxBuffer, uint32_t u32Length);
 
 /**
 *****************************************************************************
 ** \brief TSU Second counter increment callback function (cy_ethif_rx_frame_func_ptr_t).
 **
 ** Signals a One second increment in the TSU.
 *****************************************************************************/
 typedef void (*cy_ethif_tsu_inc_cb_t)();

/**
 *****************************************************************************
 ** \brief Ethernet MAC call back handlers
 *****************************************************************************/
 typedef struct
 {
    cy_ethif_tx_msg_cb_t    txcompletecb;     /**< Transmit complete    */
    cy_ethif_tx_error_cb_t  txerrorcb;        /**< Tx Error    */
    cy_ethif_rx_frame_cb_t  rxframecb;        /**< Frame Received */ 
    cy_ethif_tsu_inc_cb_t   tsuSecondInccb;   /**< TSU timer Second counter incremented */
 } cy_stc_ethif_cb_t;
 
/**
 *****************************************************************************
 ** \brief Ethernet MAC detailed configurations 
 *****************************************************************************/
typedef struct
{
    bool bintrEnable;                                   /**< interrupts/events to enable on start   */
    CEDI_DmaDatBLen dmaDataBurstLen;                    /**< fixed burst length for DMA data transfers */
                                                        /**< bit4:0 amba_burst_length                                  */
                                                        /**< 1xxxx: attempt use burst up to 16 (CEDI_DMA_DBUR_LEN_16)  */
                                                        /**< 01xxx: attempt use burst up to  8 (CEDI_DMA_DBUR_LEN_8)   */
                                                        /**< 001xx: attempt use burst up to  4 (CEDI_DMA_DBUR_LEN_4)   */
                                                        /**< 0001x: always use single burst                            */
                                                        /**< 00001: always use single burst    (CEDI_AMBD_BURST_LEN_1) */
                                                        /**< 00000: best AXI burst up to 256 beats                     */
    uint8_t u8dmaCfgFlags;                              /**< DMA config register bits 24, 25 & 26.                   */
                                                        /**< OR the following bit-flags to set corresponding bits -  */
                                                        /**< CEDI_CFG_DMA_DISC_RXP,              */
                                                        /**< CEDI_CFG_DMA_FRCE_RX_BRST,          */
                                                        /**< CEDI_CFG_DMA_FRCE_TX_BRST        */
    CEDI_MdcClkDiv mdcPclkDiv;                          /**< divisor to generate MDC from pclk */
                                                        /**< CEDI_MDC_DIV_BY_8 = 0       */
                                                        /**< CEDI_MDC_DIV_BY_16 = 1      */
                                                        /**< CEDI_MDC_DIV_BY_32 = 2      */
                                                        /**< CEDI_MDC_DIV_BY_48 = 3      */
                                                        /**< CEDI_MDC_DIV_BY_64 = 4      */
                                                        /**< CEDI_MDC_DIV_BY_96 = 5      */
                                                        /**< CEDI_MDC_DIV_BY_128 = 6     */
                                                        /**< CEDI_MDC_DIV_BY_224 = 7     */
    uint8_t u8rxLenErrDisc;                             /**< enable discard of frames with length field error */
    uint8_t u8disCopyPause;                             /**< disable copying Rx pause frames to memory */
    uint8_t u8chkSumOffEn;                              /**< enable checksum offload operation - OR bit-flags
                                                        * to enable in Tx and/or Rx:
                                                        * CEDI_CFG_CHK_OFF_TX,  CEDI_CFG_CHK_OFF_RX     */
    uint8_t u8rx1536ByteEn;                             /**< enable Rx of frames up to 1536 bytes */
    uint8_t u8rxJumboFrEn;                              /**< enable Rx of jumbo frames */    
    uint8_t u8enRxBadPreamble;                          /**< enable Rx frames with non-standard preamble */    
    uint8_t u8ignoreIpgRxEr;                            /**< ignore IPG rx_er (NetCfg b30) */    
    uint8_t u8storeUdpTcpOffset;                        /**< u8storeUdpTcpOffset */
    uint8_t u8aw2wMaxPipeline;                          /**< Maximum number of outstanding AXI write requests,
                                                        * that can be issued by DMA via the AW channel.
                                                        * Must not be = 0 if using AXI as this would disable writes
                                                        */    
    uint8_t u8ar2rMaxPipeline;                          /**< Maximum number of outstanding AXI read requests,
                                                        * that can be issued by DMA via the AR channel.
                                                        * Must not be = 0 if using AXI as this would disable reads
                                                        */
    uint8_t u8pfcMultiQuantum;                          /**< enable pfc multiple quantum (8 different priorities) */       
    cy_stc_ethif_wrapper_config_t * pstcWrapperConfig;    /**< Configuration for Wrapper */
    cy_stc_ethif_tsu_config_t *     pstcTSUConfig;        /**< Configuration for TSU */
    bool btxq0enable;                                   /**< Tx Q0 Enable    */
    bool btxq1enable;                                   /**< Tx Q1 Enable    */    
    bool btxq2enable;                                   /**< Tx Q2 Enable    */
    bool brxq0enable;                                   /**< Rx Q0 Enable    */
    bool brxq1enable;                                   /**< Rx Q1 Enable    */
    bool brxq2enable;                                   /**< Rx Q2 Enable    */
    
