ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_ethif.h
} cy_stc_ethif_config_t;

/**
 ******************************************************************************
 ** \brief Interrupt configuration for Ethernet MAC
 ******************************************************************************/
typedef struct
{
    bool btsu_time_match;                  /**< Time stamp unit time match event */
    bool bwol_rx;                          /**< Wake on LAN event received */
    bool blpi_ch_rx;                       /**< LPI indication status bit change received */    /* TODO: LPI, wait for conclusion?    */
    bool btsu_sec_inc;                     /**< TSU seconds register increment */
    bool bptp_tx_pdly_rsp;                 /**< PTP pdelay_resp frame transmitted */
    bool bptp_tx_pdly_req ;                /**< PTP pdelay_req frame transmitted */
    bool bptp_rx_pdly_rsp;                 /**< PTP pdelay_resp frame received */
    bool bptp_rx_pdly_req;                 /**< PTP pdelay_req frame received */
    bool bptp_tx_sync;                     /**< PTP sync frame transmitted */
    bool bptp_tx_dly_req;                  /**< PTP delay_req frame transmitted */
    bool bptp_rx_sync;                     /**< PTP sync frame received */
    bool bptp_rx_dly_req;                  /**< PTP delay_req frame received */
    // bool bpcs_lp_page_rx;                  /** PCS auto-negotiation link partner page received */
    // bool bpcs_an_complete;                 /** PCS auto-negotiation has completed */
    bool bext_intr;                        /**< External input interrupt detected */
    bool bpause_frame_tx;                  /**< Pause frame transmitted */
    bool bpause_time_zero;                 /**< Pause time reaches zero or zeroq pause frame received */
    bool bpause_nz_qu_rx;                  /**< Pause frame with non-zero quantum received */
    bool bhresp_not_ok;                    /**< DMA hresp not OK */
    bool brx_overrun;                      /**< Rx overrun error */
    bool bpcs_link_change_det;             /**< Link status change detected by PCS */           /* TODO: PCS, wait for conclusion   */
    bool btx_complete;                     /**< Frame has been transmitted successfully */
    bool btx_fr_corrupt;                   /**< Tx frame corruption */
    bool btx_retry_ex_late_coll;           /**< Retry limit exceeded or late collision */
    bool btx_underrun;                     /**< Tx underrun */
    bool btx_used_read;                    /**< Used bit set has been read in Tx descriptor list */
    bool brx_used_read;                    /**< Used bit set has been read in Rx descriptor list */
    bool brx_complete;                     /**< Frame received successfully and stored */
    bool bman_frame;                       /**< Management Frame Sent */
} cy_stc_ethif_interruptconfig_t;


/**
 ******************************************************************************
 ** \brief filter configuration for Ethernet MAC
 ******************************************************************************/

typedef struct
{
    cy_en_ethif_filter_type_t typeFilter; /**< typeFilter */
    CEDI_MacAddress         filterAddr;   /**< filterAddr */
    uint8_t                 ignoreBytes;  /**< e.g. ignoreBytes = 0x01 implies first byte received should not be compared.
                                          * e.g. ignoreBytes = 0x03 implies first and second byte received should not be compared. */
} cy_stc_ethif_filter_config_t;

/** \} group_ethif_data_structures */


/** \} group_ethif_data_structures */

/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_ethif_functions
* \{
*/

cy_en_ethif_status_t Cy_ETHIF_Init(cy_stc_ethif_config_t *pstcEthIfConfig, cy_stc_ethif_interruptconfig_t *pstcInterruptList);
void Cy_ETHIF_RegisterCallbacks(cy_stc_ethif_cb_t *cbFuncsList);
void Cy_ETHIF_DecodeEvent(void);
uint8_t Cy_ETHIF_ClearReleasedBuf(bool bClearAll, bool bTransmitBuf);
cy_en_ethif_status_t Cy_ETHIF_TransmitFrame(uint8_t * pu8TxBuffer, uint16_t u16Length, uint8_t u8QueueIndex, bool bEndBuffer);
cy_en_ethif_status_t Cy_ETHIF_Get1588TimerValue(CEDI_1588TimerVal* stcRetTmrValue);
cy_en_ethif_status_t Cy_ETHIF_Set1588TimerValue(CEDI_1588TimerVal * pstcTmrValue);
cy_en_ethif_status_t Cy_ETHIF_TxPauseFrame(bool bZeroTQ);
cy_en_ethif_status_t Cy_ETHIF_ConfigPause(uint16_t u16PauseQuanta);
cy_en_ethif_status_t Cy_ETHIF_PhyRegWrite(uint8_t u8RegNo, uint16_t u16Data, uint8_t u8PHYAddr);
uint32_t Cy_ETHIF_PhyRegRead(uint8_t u8RegNo, uint8_t u8PHYAddr);
cy_en_ethif_status_t Cy_ETHIF_SetFilterAddress(cy_en_ethif_filter_num_t filterNo, const cy_stc_ethif_filter_config_t* config);
void Cy_ETHIF_SetCopyAllFrames(bool toBeEnabled);
void Cy_ETHIF_SetNoBroadCast(bool rejectBC);

/** \} group_ethif_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXETH */

#endif /* CY_ETHIF_H */

/** \} group_eth */

/* [] END OF FILE */